Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
time_distributed_1 (TimeDist (None, 30, 300, 300, 32)  896
_________________________________________________________________
time_distributed_2 (TimeDist (None, 30, 300, 300, 32)  9248
_________________________________________________________________
time_distributed_3 (TimeDist (None, 30, 300, 300, 32)  128
_________________________________________________________________
time_distributed_4 (TimeDist (None, 30, 300, 300, 32)  0
_________________________________________________________________
time_distributed_5 (TimeDist (None, 30, 150, 150, 32)  0
_________________________________________________________________
time_distributed_6 (TimeDist (None, 30, 150, 150, 64)  18496
_________________________________________________________________
time_distributed_7 (TimeDist (None, 30, 150, 150, 64)  36928
_________________________________________________________________
time_distributed_8 (TimeDist (None, 30, 150, 150, 64)  256
_________________________________________________________________
time_distributed_9 (TimeDist (None, 30, 150, 150, 64)  0
_________________________________________________________________
time_distributed_10 (TimeDis (None, 30, 75, 75, 64)    0
_________________________________________________________________
time_distributed_11 (TimeDis (None, 30, 360000)        0
_________________________________________________________________
lstm_1 (LSTM)                (None, 30, 256)           368903168
_________________________________________________________________
lstm_2 (LSTM)                (None, 256)               525312
_________________________________________________________________
dense_1 (Dense)              (None, 29)                7453
=================================================================
Total params: 369,501,885
Trainable params: 369,501,693
Non-trainable params: 192
_________________________________________________________________